app/controllers/api/tasks_controller.rb

  def create
    @task = Task.new(task_new_params)
    if @task.save
---
INSERT INTO `tasks` (`title`, `description`, `due_date`, `status`, `completed_date`, `assigned_to_id`, `priority`, `progess_percentage`, `created_at`, `updated_at`) VALUES ('Task Title', 'Task Description', '2024-03-03', 1, NULL, NULL, NULL, NULL, '2024-02-22 10:57:05.086568', '2024-02-22 10:57:05.086568')

  def update
    if @task.update(task_update_params)
---
UPDATE `tasks` SET `tasks`.`priority` = 1, `tasks`.`updated_at` = '2024-02-22 10:58:30.268990' WHERE `tasks`.`id` = 11

  def destroy
    if @task.destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 11

  def assign
    if @task.update(task_assign_params)
---
UPDATE `tasks` SET `tasks`.`assigned_to_id` = 1, `tasks`.`updated_at` = '2024-02-22 10:06:26.253269' WHERE `tasks`.`id` = 11

  def progress
    if @task.update(task_progress_params)
---
UPDATE `tasks` SET `tasks`.`progess_percentage` = 44, `tasks`.`updated_at` = '2024-02-22 10:27:27.701455' WHERE `tasks`.`id` = 10

  def set_tasks
    @tasks = Task.order("due_date desc, priority asc")
---
SELECT `tasks`.* FROM `tasks` WHERE (due_date < '2024-02-22') ORDER BY due_date desc, priority asc